Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 100)               100100    
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 202       
=================================================================
Total params: 100,302
Trainable params: 100,302
Non-trainable params: 0
_________________________________________________________________
None
